db/tests/loadtest_styles.yml
config:
  target: 'http://localhost:6868'
  phases:
    - name: Warm up
      duration: 10
      arrivalRate: 10
    - name: Ramp up 1
      duration: 5
      arrivalRate: 10
      rampTo: 100
    - name: Ramp up 2
      duration: 5
      arrivalRate: 100
      rampTo: 1000
    - name: Load test
      duration: 10
      arrivalRate: 1000

scenarios:
  - name: 'Look up random product styles'
    flow:
      - get:
          url: '/products/{{$randomNumber(1, 1000011)}}/styles'